# @Version  : 1.0
# @Author   : LiHongFei
# @File     : 01_arithmetic_operator.py
# @Time     : 2024/9/7 23:18

# 演示算术运算符的使用

# /, //, %, **

# 对于除号 /, 返回结果是小数
print(10 / 3)  # 3.3333333333333335
print(-9 / 2)  # -4.5

 # 对于取整除 // , 返回商的整数部分(并且向下取整)
print(10 // 3)  # 3
print(-9 // 2)  # -5
print(-10 // 3)  # -4

# 视频弹幕讲解：Python 中的取余运算（%）遵循的规则是：结果的符号与除数（第二个操作数）相同。
# 当对一个数取模时，对应的运算公式: a % b = a - a // b * b
print(10 % 3)  # 1
# 分析：-10 % 3 = -10 - (-10) // 3 * 3 = -10 - (-4) * 3 = -10 + 12 = 2
print(-10 % 3)  # 2
# 分析 10 % -3 = 10 - 10 // (-3) * (-3) = 10 - (-4) * (-3) = 10 - 12 = -2
print(10 % -3)  # -2
# 分析 -10 % -3 = -10 - (-10) // (-3) * (-3) = -10 - 3 * (-3) = -10 + 9 = -1
print(-10 % -3) # -1

print(2 ** 5)  # 32
print(9 ** 2)  # 81